test/xml/MulticastProbeSample_HI3518C.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope"
	xmlns:enc="http://www.w3.org/2003/05/soap-encoding"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
	xmlns:wsa5="http://www.w3.org/2005/08/addressing"
	xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
	xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
	xmlns:tt="http://www.onvif.org/ver10/schema"
	xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
	<s:Header>
		<wsa:MessageID>uuid:72d64012-6a26-6854-605f-3f1444471d6f</wsa:MessageID>
		<wsa:RelatesTo>uuid:574af2ff-fede-4e63-ab0e-94d9e0626854</wsa:RelatesTo>
		<wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
	</s:Header>
	<s:Body>
		<d:ProbeMatches>
			<d:ProbeMatch>
				<wsa:EndpointReference>
					<wsa:Address>urn:uuid:0cf61ca3-1ef0-39a4-24b3-756528520d0d</wsa:Address>
				</wsa:EndpointReference>
				<d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
				<d:Scopes>onvif://www.onvif.org/location/country/china onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/name/IP-Camera onvif://www.onvif.org/hardware/HI3518C onvif://www.onvif.org/Profile/Streaming onvif://www.onvif.org/Profile/T onvif://www.onvif.org/Profile/G onvif://www.onvif.org/Profile/C onvif://www.onvif.org/Profile/A onvif://www.onvif.org/Profile/M</d:Scopes>
				<d:XAddrs>http://192.168.2.177:8000/onvif/device_service</d:XAddrs>
				<d:MetadataVersion>1</d:MetadataVersion>
			</d:ProbeMatch>
		</d:ProbeMatches>
	</s:Body>
</s:Envelope>